ЧартерEDT.Расширение1/src/Reports/RoomsOccupationHistory/RoomsOccupationHistory.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="0c33a9c6-4d56-4cad-afca-d036f91e5d75">
  <name>RoomsOccupationHistory</name>
  <objectBelonging>Adopted</objectBelonging>
</mdclass:Report>

ЧартерEDT.Расширение1/src/AccumulationRegisters/RoomInventory/RoomInventory.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="aeb81e75-04ad-4f43-868f-b8ea2669c5d7">
  <name>RoomInventory</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="7187f02a-e01a-4fa4-a90d-ed9ace802a97">
    <name>Counter</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="c26c8823-5255-4588-91ab-3f27f6c31ff5">
    <name>TotalRooms</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="78098442-cc9e-4761-848d-af64c2f5109f">
    <name>TotalBeds</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="357a8f84-1ec8-4df6-9544-5f74d86b72dc">
    <name>RoomsBlocked</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="22789c75-f8a9-477f-9281-68c367895c20">
    <name>BedsBlocked</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="bd1ad0c3-3520-47a2-bdf8-f2fef29a4b16">
    <name>ExpectedRoomsCheckedOut</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="62777090-ae79-44c3-adca-787e958cc1e8">
    <name>ExpectedBedsCheckedOut</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="971c16cd-9b59-45e8-819e-a9a3c7e36f30">
    <name>ExpectedGuestsCheckedOut</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="c1a65555-7280-42d8-953d-4784a4163e9f">
    <name>GuestsReserved</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="0f95b9b2-b56a-4639-a4f1-fca810dc2b4c">
    <name>RoomsReserved</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="5d6674d8-44b4-44fb-b651-3f701f20e111">
    <name>RoomsVacant</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="c4b4557e-9287-41d4-8e59-2df23edb9117">
    <name>BedsVacant</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <attributes extendedConfigurationObject="ecdde1f9-5cf0-450e-9c85-240a41e21dc3">
    <name>IsInHouse</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e2dd1591-19cc-42df-853b-928c89fabd9b">
    <name>IsAccommodation</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0bee4da2-3939-441c-b5f7-b1232729f041">
    <name>PeriodFrom</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8b252a75-9287-4325-a6cb-0a88bdce9ca2">
    <name>PeriodTo</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="46d7e314-d052-46d5-8347-a165acef5625">
    <name>Customer</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="95181482-afb2-4654-9864-0ec98c2b823d">
    <name>GuestGroup</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="31da10c9-481a-48a5-ac2c-46a0315d7a6f">
    <name>Guest</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e9ecc1c4-80e9-4cf0-8d39-e9e904be978a">
    <name>CheckOutDate</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="dda37713-d4e8-4591-886d-de3bfbcc0dad">
    <name>NumberOfPersons</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b999d1f7-084e-4966-935f-e9425a773bad">
    <name>IsCheckOut</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ad21bcb0-f275-4cd5-aaa9-b4f0ac09f5e1">
    <name>IsReservation</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="daff9aed-b7c8-4664-8fc9-8434ccd4dcad">
    <name>CheckInDate</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="efee26ee-0b75-4a40-80b3-1cef1c5a4ba0">
    <name>RoomQuota</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions extendedConfigurationObject="860bbeda-97f5-4e71-9843-8c52beecca35">
    <name>Room</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="0f7bef0b-3f02-45bd-bf04-1f07ad0da4e1">
    <name>Hotel</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="187fbf66-3954-47d0-8c0f-925b11f74ee2">
    <name>RoomType</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

ЧартерEDT.Расширение1/src/AccumulationRegisters/Sales/Sales.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="3e6aaed7-05fd-4623-81c0-df3add697d5e">
  <name>Sales</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <registerType>Turnovers</registerType>
  <dimensions extendedConfigurationObject="1df4f838-7d2e-4e70-a571-1330ae18b412">
    <name>Room</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="109438a6-2e88-4026-a452-23cdd232e828">
    <name>Hotel</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

ЧартерEDT.Расширение1/src/Reports/RoomsOccupationHistory/ObjectModule.bsl
&ChangeAndValidate("pmInitializeReportBuilder")
Procedure Расш1_pmInitializeReportBuilder()
	ReportBuilder = New ReportBuilder();

	// Initialize default query text
	#Вставка
	QueryText = 
	"SELECT Разрешенные
	|	RoomInventory.Recorder.Hotel AS Hotel,
	|	RoomInventory.Room AS Room,
	|	RoomInventory.Recorder.Customer AS Customer,
	|	RoomInventory.Recorder.AccommodationStatus AS AccommodationStatus,
	|	RoomInventory.Recorder.Guest AS Guest,
	|	RoomInventory.CheckInDate AS CheckInDate,
	|	RoomInventory.Duration AS Duration,
	|	RoomInventory.CheckOutDate AS CheckOutDate,
	|	RoomInventory.RoomType AS RoomType,
	|	RoomInventory.AccommodationType AS AccommodationType,
	|	RoomInventory.Recorder.RoomRate AS RoomRate,
	|	RoomInventory.Recorder.Remarks AS Remarks,
	|	RoomInventory.Recorder.GuestGroup AS GuestGroup,
	|	CASE
	|		WHEN &qShowMainRoomGuestsOnly
	|			THEN ISNULL(RoomInventory.Recorder.NumberOfAdults, 0) + ISNULL(RoomInventory.Recorder.NumberOfTeenagers, 0) + ISNULL(RoomInventory.Recorder.NumberOfChildren, 0) + ISNULL(RoomInventory.Recorder.NumberOfInfants, 0)
	|		ELSE RoomInventory.InHouseGuests
	|	END AS InHouseGuests,
	|	ISNULL(RoomInventory.Recorder.NumberOfAdults, 0) AS NumberOfAdults,
	|	ISNULL(RoomInventory.Recorder.NumberOfTeenagers, 0) AS NumberOfTeenagers,
	|	ISNULL(RoomInventory.Recorder.NumberOfChildren, 0) AS NumberOfChildren,
	|	ISNULL(RoomInventory.Recorder.NumberOfInfants, 0) AS NumberOfInfants,
	|	RoomInventory.InHouseRooms AS InHouseRooms,
	|	RoomInventory.InHouseBeds AS InHouseBeds,
	|	RoomInventory.InHouseAdditionalBeds AS InHouseAdditionalBeds,
	|	RoomInventory.Recorder.HotelProduct.Sum AS HotelProductSum,
	|	RoomInventory.Recorder.PricePresentation AS PricePresentation,
	|	ExpectedRoomMoves.Room AS RoomTo,
	|	ISNULL(GuestPeriodSales.Sales, 0) AS Sales,
	|	ISNULL(GuestPeriodSales.RoomRevenue, 0) AS RoomRevenue,
	|	ISNULL(ClientBalances.ClientSumBalance, 0) AS ClientSumBalance,
	|	ISNULL(ClientTotals.NumberOfCheckins, 0) AS NumberOfCheckins
	|{SELECT
	|	Hotel.*,
	|	Room.*,
	|	RoomInventory.Recorder.CustomerType.* AS CustomerType,
	|	Customer.*,
	|	RoomInventory.Recorder.Contract.* AS Contract,
	|	RoomInventory.Recorder.ContactPerson AS ContactPerson,
	|	RoomInventory.Recorder.Agent.* AS Agent,
	|	RoomInventory.Recorder.ClientType.* AS ClientType,
	|	Guest.*,
	|	CheckInDate,
	|	Duration,
	|	CheckOutDate,
	|	RoomInventory.CheckInAccountingDate AS CheckInAccountingDate,
	|	RoomInventory.CheckOutAccountingDate AS CheckOutAccountingDate,
	|	(HOUR(RoomInventory.Recorder.CheckInDate)) AS CheckInHour,
	|	(DAY(RoomInventory.Recorder.CheckInDate)) AS CheckInDay,
	|	(WEEK(RoomInventory.Recorder.CheckInDate)) AS CheckInWeek,
	|	(MONTH(RoomInventory.Recorder.CheckInDate)) AS CheckInMonth,
	|	(QUARTER(RoomInventory.Recorder.CheckInDate)) AS CheckInQuarter,
	|	(YEAR(RoomInventory.Recorder.CheckInDate)) AS CheckInYear,
	|	RoomType.*,
	|	AccommodationType.*,
	|	RoomInventory.Recorder.RoomRateType.* AS RoomRateType,
	|	RoomInventory.Recorder.AccommodationTemplate.* AS AccommodationTemplate,
	|	RoomRate.*,
	|	PricePresentation,
	|	RoomInventory.Recorder.PlannedPaymentMethod.* AS PlannedPaymentMethod,
	|	InHouseGuests,
	|	NumberOfAdults,
	|	NumberOfTeenagers,
	|	NumberOfChildren,
	|	NumberOfInfants,
	|	InHouseRooms,
	|	InHouseBeds,
	|	InHouseAdditionalBeds,
	|	Remarks,
	|	RoomInventory.Recorder.Car AS Car,
	|	GuestGroup.*,
	|	AccommodationStatus.*,
	|	RoomInventory.Recorder.IsMaster AS IsMaster,
	|	RoomInventory.Recorder.HotelProduct.* AS HotelProduct,
	|	RoomInventory.Recorder.RoomQuota.* AS RoomQuota,
	|	RoomInventory.Recorder.MarketingCode.* AS MarketingCode,
	|	RoomInventory.Recorder.TripPurpose.* AS TripPurpose,
	|	RoomInventory.Recorder.SourceOfBusiness.* AS SourceOfBusiness,
	|	RoomInventory.Recorder.DiscountCard.* AS DiscountCard,
	|	RoomInventory.Recorder.DiscountType.* AS DiscountType,
	|	RoomInventory.Recorder.Discount AS Discount,
	|	RoomInventory.Recorder.AgentCommission AS AgentCommission,
	|	RoomInventory.Recorder.AgentCommissionType AS AgentCommissionType,
	|	RoomInventory.Recorder.RoomQuantity AS RoomQuantity,
	|	RoomInventory.Recorder.NumberOfBedsPerRoom AS NumberOfBedsPerRoom,
	|	RoomInventory.Recorder.NumberOfPersonsPerRoom AS NumberOfPersonsPerRoom,
	|	HotelProductSum,
	|	RoomInventory.Recorder.HotelProduct.Currency.* AS HotelProductCurrency,
	|	RoomInventory.Recorder.ParentDoc.* AS ParentDoc,
	|	RoomInventory.Recorder.Author.* AS Author,
	|	RoomInventory.Recorder.* AS Recorder,
	|	RoomTo.*,
	|	RoomInventory.ForeignerRegistryRecord.* AS ForeignerRegistryRecord,
	|	RoomInventory.ClientDataScan.* AS ClientDataScan,
	|	(CASE
	|			WHEN RoomInventory.ForeignerRegistryRecord.MigrationCardDateTo <> &qEmptyDate
	|				THEN DATEDIFF(RoomInventory.ForeignerRegistryRecord.MigrationCardDateTo, RoomInventory.Recorder.CheckOutDate, DAY)
	|			ELSE 0
	|		END) AS MigrationCardDateToDeviance,
	|	(CASE
	|			WHEN RoomInventory.ForeignerRegistryRecord.VisaToDate <> &qEmptyDate
	|				THEN DATEDIFF(RoomInventory.ForeignerRegistryRecord.VisaToDate, RoomInventory.Recorder.CheckOutDate, DAY)
	|			ELSE 0
	|		END) AS VisaToDateDeviance,
	|	RoomInventory.Recorder.PointInTime AS PointInTime,
	|	Sales,
	|	RoomRevenue,
	|	ClientSumBalance,
	|	NumberOfCheckins,
	|	(NULL) AS EmptyColumn}
	|FROM
	|	(SELECT
	|		RoomInventoryPeriods.Recorder AS Recorder,
	|		RoomInventoryPeriods.Room AS Room,
	|		RoomInventoryPeriods.RoomType AS RoomType,
	|		RoomInventoryPeriods.AccommodationType AS AccommodationType,
	|		RoomInventoryPeriods.PeriodFrom AS CheckInDate,
	|		RoomInventoryPeriods.PeriodDuration AS Duration,
	|		RoomInventoryPeriods.PeriodTo AS CheckOutDate,
	|		RoomInventoryPeriods.CheckInAccountingDate AS CheckInAccountingDate,
	|		RoomInventoryPeriods.CheckOutAccountingDate AS CheckOutAccountingDate,
	|		CASE
	|			WHEN ForeignerRegistryRecords.ForeignerRegistryRecord IS NULL
	|				THEN &qEmptyForeignerRegistryRecord
	|			ELSE ForeignerRegistryRecords.ForeignerRegistryRecord
	|		END AS ForeignerRegistryRecord,
	|		CASE
	|			WHEN ClientDataScans.Ref IS NULL
	|				THEN &qEmptyClientDataScan
	|			ELSE ClientDataScans.Ref
	|		END AS ClientDataScan,
	|		MAX(RoomInventoryPeriods.InHouseGuests) AS InHouseGuests,
	|		MAX(RoomInventoryPeriods.InHouseRooms) AS InHouseRooms,
	|		MAX(RoomInventoryPeriods.InHouseBeds) AS InHouseBeds,
	|		MAX(RoomInventoryPeriods.InHouseAdditionalBeds) AS InHouseAdditionalBeds
	|	FROM
	|		AccumulationRegister.RoomInventory AS RoomInventoryPeriods
	|			LEFT JOIN InformationRegister.AccommodationForeignerRegistryRecords.SliceLast(&qEndOfTime, &qShowFRR) AS ForeignerRegistryRecords
	|			ON RoomInventoryPeriods.Recorder = ForeignerRegistryRecords.Accommodation
	|			LEFT JOIN Document.ClientDataScans AS ClientDataScans
	|			ON RoomInventoryPeriods.Recorder = ClientDataScans.ParentDoc
	|				AND (ClientDataScans.Posted)
	|				AND (&qShowCDS)
	|	WHERE
	|		RoomInventoryPeriods.RecordType = VALUE(AccumulationRecordType.Expense)
	|		AND RoomInventoryPeriods.IsAccommodation = TRUE
	|		AND RoomInventoryPeriods.Hotel IN HIERARCHY(&qHotel)
	|		AND RoomInventoryPeriods.Room IN HIERARCHY(&qRoom)
	|		AND RoomInventoryPeriods.RoomType IN HIERARCHY(&qRoomType)
	|		AND (&qCustomerIsEmpty
	|				OR RoomInventoryPeriods.Customer IN HIERARCHY (&qCustomer))
	|		AND (&qGuestIsEmpty
	|				OR RoomInventoryPeriods.Guest IN HIERARCHY (&qGuest))
	|		AND (ISNULL(RoomInventoryPeriods.AccommodationStatus.IsInHouse, FALSE)
	|				OR NOT &qShowInHouseOnly)
	|		AND (NOT ISNULL(RoomInventoryPeriods.AccommodationStatus.IsInHouse, FALSE)
	|				OR NOT &qShowNotInHouseOnly)
	|		AND (RoomInventoryPeriods.PeriodFrom < &qPeriodTo
	|					AND RoomInventoryPeriods.PeriodTo > &qPeriodFrom
	|					AND &qPeriodCheckType = &qAccommodation
	|				OR RoomInventoryPeriods.PeriodFrom >= &qPeriodFrom
	|					AND RoomInventoryPeriods.PeriodFrom < &qPeriodTo
	|					AND RoomInventoryPeriods.PeriodFrom = RoomInventoryPeriods.CheckInDate
	|					AND (&qPeriodCheckType = &qCheckIn
	|						OR &qPeriodCheckType = &qCheckInOrCheckOut)
	|				OR RoomInventoryPeriods.PeriodTo > &qPeriodFrom
	|					AND RoomInventoryPeriods.PeriodTo <= &qPeriodTo
	|					AND RoomInventoryPeriods.PeriodTo = RoomInventoryPeriods.CheckOutDate
	|					AND (&qPeriodCheckType = &qCheckOut
	|						OR &qPeriodCheckType = &qCheckInOrCheckOut)
	|				OR RoomInventoryPeriods.Recorder.Date >= &qPeriodFrom
	|					AND RoomInventoryPeriods.Recorder.Date < &qPeriodTo
	|					AND &qPeriodCheckType = &qDocDateInPeriod)
	|	
	|	GROUP BY
	|		RoomInventoryPeriods.Recorder,
	|		RoomInventoryPeriods.Room,
	|		RoomInventoryPeriods.RoomType,
	|		RoomInventoryPeriods.AccommodationType,
	|		RoomInventoryPeriods.PeriodFrom,
	|		RoomInventoryPeriods.PeriodDuration,
	|		RoomInventoryPeriods.PeriodTo,
	|		RoomInventoryPeriods.CheckInAccountingDate,
	|		RoomInventoryPeriods.CheckOutAccountingDate,
	|		CASE
	|			WHEN ForeignerRegistryRecords.ForeignerRegistryRecord IS NULL
	|				THEN &qEmptyForeignerRegistryRecord
	|			ELSE ForeignerRegistryRecords.ForeignerRegistryRecord
	|		END,
	|		CASE
	|			WHEN ClientDataScans.Ref IS NULL
	|				THEN &qEmptyClientDataScan
	|			ELSE ClientDataScans.Ref
	|		END) AS RoomInventory
	|		LEFT JOIN (SELECT
	|			GuestSales.ParentDoc AS ParentDoc,
	|			GuestSales.SalesTurnover AS Sales,
	|			GuestSales.RoomRevenueTurnover AS RoomRevenue
	|		FROM
	|			AccumulationRegister.Sales.Turnovers(
	|					&qBegOfPeriodFrom,
	|					&qEndOfPeriodTo,
	|					,
	|					&qShowSales
	|						AND NOT IsCorrection) AS GuestSales) AS GuestPeriodSales
	|		ON RoomInventory.Recorder = GuestPeriodSales.ParentDoc
	|			AND (&qShowSales)
	|		LEFT JOIN (SELECT
	|			AccountsBalance.Folio.ParentDoc AS FolioParentDoc,
	|			SUM(AccountsBalance.SumBalance) AS ClientSumBalance
	|		FROM
	|			AccumulationRegister.Accounts.Balance(
	|					&qEndOfPeriodTo,
	|					&qShowBalances
	|						AND (Folio.Customer = &qEmptyCustomer
	|							OR Folio.Customer <> &qEmptyCustomer
	|								AND Folio.Customer.IsIndividual)) AS AccountsBalance
	|		
	|		GROUP BY
	|			AccountsBalance.Folio.ParentDoc) AS ClientBalances
	|		ON RoomInventory.Recorder = ClientBalances.FolioParentDoc
	|			AND (&qShowBalances)
	|		LEFT JOIN (SELECT
	|			ClientTurnovers.Client AS Client,
	|			ClientTurnovers.GuestsCheckedInTurnover AS NumberOfCheckins
	|		FROM
	|			AccumulationRegister.Sales.Turnovers(
	|					,
	|					&qBegOfPeriodFrom,
	|					PERIOD,
	|					&qNumberOfVisitsIsUsed
	|						AND NOT IsCorrection
	|						AND (&qHotelIsEmpty
	|							OR Hotel IN HIERARCHY (&qHotel))) AS ClientTurnovers) AS ClientTotals
	|		ON RoomInventory.Recorder.Guest = ClientTotals.Client
	|		LEFT JOIN Document.Accommodation.RoomRates AS ExpectedRoomMoves
	|		ON RoomInventory.Recorder = ExpectedRoomMoves.Ref
	|			AND RoomInventory.Recorder.Room <> ExpectedRoomMoves.Room
	|			AND (BEGINOFPERIOD(ExpectedRoomMoves.AccountingDate, DAY) = &qBegOfPeriodFrom)
	|WHERE
	|	(NOT &qShowMainRoomGuestsOnly
	|			OR &qShowMainRoomGuestsOnly
	|				AND RoomInventory.Recorder.AccommodationTemplate <> &qEmptyTemplate)
	|	AND (NOT &qShowRoomMovesOnly
	|			OR &qShowRoomMovesOnly
	|				AND NOT ExpectedRoomMoves.Room IS NULL)
	|{WHERE
	|	RoomInventory.Recorder.* AS Recorder,
	|	RoomInventory.ForeignerRegistryRecord.* AS ForeignerRegistryRecord,
	|	RoomInventory.ClientDataScan.* AS ClientDataScan,
	|	RoomInventory.Recorder.Hotel.* AS Hotel,
	|	RoomInventory.RoomType.* AS RoomType,
	|	RoomInventory.Room.* AS Room,
	|	RoomInventory.AccommodationType.* AS AccommodationType,
	|	RoomInventory.Recorder.Customer.* AS Customer,
	|	RoomInventory.Recorder.CustomerType AS CustomerType,
	|	RoomInventory.Recorder.Contract.* AS Contract,
	|	RoomInventory.Recorder.ContactPerson AS ContactPerson,
	|	RoomInventory.Recorder.Agent.* AS Agent,
	|	RoomInventory.Recorder.GuestGroup.* AS GuestGroup,
	|	RoomInventory.Recorder.ParentDoc.* AS ParentDoc,
	|	RoomInventory.Recorder.HotelProduct.* AS HotelProduct,
	|	RoomInventory.Recorder.AccommodationStatus.* AS AccommodationStatus,
	|	RoomInventory.CheckInDate AS CheckInDate,
	|	RoomInventory.Duration AS Duration,
	|	RoomInventory.CheckOutDate AS CheckOutDate,
	|	RoomInventory.CheckInAccountingDate AS CheckInAccountingDate,
	|	RoomInventory.CheckOutAccountingDate AS CheckOutAccountingDate,
	|	(CASE
	|			WHEN &qShowMainRoomGuestsOnly
	|				THEN ISNULL(RoomInventory.Recorder.NumberOfAdults, 0) + ISNULL(RoomInventory.Recorder.NumberOfTeenagers, 0) + ISNULL(RoomInventory.Recorder.NumberOfChildren, 0) + ISNULL(RoomInventory.Recorder.NumberOfInfants, 0)
	|			ELSE RoomInventory.InHouseGuests
	|		END) AS InHouseGuests,
	|	(ISNULL(RoomInventory.Recorder.NumberOfAdults, 0)) AS NumberOfAdults,
	|	(ISNULL(RoomInventory.Recorder.NumberOfTeenagers, 0)) AS NumberOfTeenagers,
	|	(ISNULL(RoomInventory.Recorder.NumberOfChildren, 0)) AS NumberOfChildren,
	|	(ISNULL(RoomInventory.Recorder.NumberOfInfants, 0)) AS NumberOfInfants,
	|	RoomInventory.InHouseRooms AS InHouseRooms,
	|	RoomInventory.InHouseBeds AS InHouseBeds,
	|	RoomInventory.InHouseAdditionalBeds AS InHouseAdditionalBeds,
	|	(ISNULL(GuestPeriodSales.Sales, 0)) AS Sales,
	|	(ISNULL(GuestPeriodSales.RoomRevenue, 0)) AS RoomRevenue,
	|	(ISNULL(ClientBalances.ClientSumBalance, 0)) AS ClientSumBalance,
	|	RoomInventory.Recorder.RoomQuota.* AS RoomQuota,
	|	RoomInventory.Recorder.RoomQuantity AS RoomQuantity,
	|	RoomInventory.Recorder.ClientType.* AS ClientType,
	|	RoomInventory.Recorder.Guest.* AS Guest,
	|	RoomInventory.Recorder.MarketingCode.* AS MarketingCode,
	|	RoomInventory.Recorder.TripPurpose.* AS TripPurpose,
	|	RoomInventory.Recorder.SourceOfBusiness.* AS SourceOfBusiness,
	|	RoomInventory.Recorder.RoomRateType.* AS RoomRateType,
	|	RoomInventory.Recorder.RoomRate.* AS RoomRate,
	|	RoomInventory.Recorder.PricePresentation AS PricePresentation,
	|	RoomInventory.Recorder.DiscountCard.* AS DiscountCard,
	|	RoomInventory.Recorder.DiscountType.* AS DiscountType,
	|	RoomInventory.Recorder.Discount AS Discount,
	|	RoomInventory.Recorder.PlannedPaymentMethod.* AS PlannedPaymentMethod,
	|	RoomInventory.Recorder.Car AS Car,
	|	RoomInventory.Recorder.Remarks AS Remarks,
	|	RoomInventory.Recorder.Author.* AS Author,
	|	RoomInventory.Recorder.AgentCommission AS AgentCommission,
	|	RoomInventory.Recorder.AgentCommissionType.* AS AgentCommissionType,
	|	RoomInventory.Recorder.AccommodationTemplate.* AS AccommodationTemplate,
	|	RoomInventory.Recorder.IsMaster AS IsMaster,
	|	ExpectedRoomMoves.Room.* AS RoomTo,
	|	(CASE
	|			WHEN RoomInventory.ForeignerRegistryRecord.MigrationCardDateTo <> &qEmptyDate
	|				THEN DATEDIFF(RoomInventory.ForeignerRegistryRecord.MigrationCardDateTo, RoomInventory.Recorder.CheckOutDate, DAY)
	|			ELSE 0
	|		END) AS MigrationCardDateToDeviance,
	|	(CASE
	|			WHEN RoomInventory.ForeignerRegistryRecord.VisaToDate <> &qEmptyDate
	|				THEN DATEDIFF(RoomInventory.ForeignerRegistryRecord.VisaToDate, RoomInventory.Recorder.CheckOutDate, DAY)
	|			ELSE 0
	|		END) AS VisaToDateDeviance,
	|	(ISNULL(ClientTotals.NumberOfCheckins, 0)) AS NumberOfCheckins,
	|	RoomInventory.Recorder.AccommodationStatus.IsCheckIn AS IsCheckIn,
	|	RoomInventory.Recorder.AccommodationStatus.IsCheckOut AS IsCheckOut,
	|	RoomInventory.Recorder.AccommodationStatus.IsRoomChange AS IsRoomChange,
	|	RoomInventory.Recorder.AccommodationStatus.IsInHouse AS IsInHouse}
	|
	|ORDER BY
	|	Hotel,
	|	Room,
	|	CheckInDate,
	|	Guest
	|{ORDER BY
	|	RoomInventory.Recorder.* AS Recorder,
	|	RoomInventory.ForeignerRegistryRecord.* AS ForeignerRegistryRecord,
	|	RoomInventory.ClientDataScan.* AS ClientDataScan,
	|	Customer.* AS Customer,
	|	RoomInventory.Recorder.CustomerType.* AS CustomerType,
	|	RoomInventory.Recorder.Contract.* AS Contract,
	|	RoomInventory.Recorder.Agent.* AS Agent,
	|	GuestGroup.* AS GuestGroup,
	|	Guest.* AS Guest,
	|	RoomInventory.Recorder.MarketingCode.* AS MarketingCode,
	|	RoomInventory.Recorder.TripPurpose.* AS TripPurpose,
	|	RoomInventory.Recorder.SourceOfBusiness.* AS SourceOfBusiness,
	|	RoomRate.* AS RoomRate,
	|	RoomInventory.Recorder.RoomRateType.* AS RoomRateType,
	|	RoomInventory.Recorder.DiscountCard.* AS DiscountCard,
	|	RoomInventory.Recorder.DiscountType.* AS DiscountType,
	|	RoomInventory.Recorder.PlannedPaymentMethod.* AS PlannedPaymentMethod,
	|	Room.* AS Room,
	|	RoomType.* AS RoomType,
	|	AccommodationType.* AS AccommodationType,
	|	RoomTo.* AS RoomTo,
	|	Hotel.* AS Hotel,
	|	RoomInventory.Recorder.PointInTime AS PointInTime,
	|	CheckInDate AS CheckInDate,
	|	Duration AS Duration,
	|	CheckOutDate AS CheckOutDate,
	|	RoomInventory.Recorder.RoomRateType.* AS RoomRateType,
	|	RoomInventory.Recorder.AccommodationTemplate.* AS AccommodationTemplate,
	|	RoomRate.* AS RoomRate,
	|	PricePresentation AS PricePresentation,
	|	RoomInventory.Recorder.Author.* AS Author,
	|	InHouseGuests AS InHouseGuests,
	|	NumberOfAdults,
	|	NumberOfTeenagers,
	|	NumberOfChildren,
	|	NumberOfInfants,
	|	InHouseRooms AS InHouseRooms,
	|	InHouseBeds AS InHouseBeds,
	|	InHouseAdditionalBeds AS InHouseAdditionalBeds,
	|	RoomInventory.CheckInAccountingDate AS CheckInAccountingDate,
	|	RoomInventory.CheckOutAccountingDate AS CheckOutAccountingDate,
	|	(HOUR(RoomInventory.Recorder.CheckInDate)) AS CheckInHour,
	|	(DAY(RoomInventory.Recorder.CheckInDate)) AS CheckInDay,
	|	(WEEK(RoomInventory.Recorder.CheckInDate)) AS CheckInWeek,
	|	(MONTH(RoomInventory.Recorder.CheckInDate)) AS CheckInMonth,
	|	(QUARTER(RoomInventory.Recorder.CheckInDate)) AS CheckInQuarter,
	|	(YEAR(RoomInventory.Recorder.CheckInDate)) AS CheckInYear,
	|	Sales,
	|	RoomRevenue,
	|	ClientSumBalance,
	|	NumberOfCheckins,
	|	RoomInventory.Recorder.RoomQuota.* AS RoomQuota}
	|TOTALS
	|	SUM(InHouseGuests),
	|	SUM(NumberOfAdults),
	|	SUM(NumberOfTeenagers),
	|	SUM(NumberOfChildren),
	|	SUM(NumberOfInfants),
	|	SUM(InHouseRooms),
	|	SUM(InHouseBeds),
	|	SUM(InHouseAdditionalBeds),
	|	SUM(HotelProductSum),
	|	SUM(Sales),
	|	SUM(RoomRevenue),
	|	SUM(ClientSumBalance)
	|BY
	|	OVERALL,
	|	Hotel,
	|	Room
	|{TOTALS BY
	|	Hotel.* AS Hotel,
	|	RoomInventory.CheckInAccountingDate AS CheckInAccountingDate,
	|	RoomInventory.CheckOutAccountingDate AS CheckOutAccountingDate,
	|	(HOUR(RoomInventory.Recorder.CheckInDate)) AS CheckInHour,
	|	(DAY(RoomInventory.Recorder.CheckInDate)) AS CheckInDay,
	|	(WEEK(RoomInventory.Recorder.CheckInDate)) AS CheckInWeek,
	|	(MONTH(RoomInventory.Recorder.CheckInDate)) AS CheckInMonth,
	|	(QUARTER(RoomInventory.Recorder.CheckInDate)) AS CheckInQuarter,
	|	(YEAR(RoomInventory.Recorder.CheckInDate)) AS CheckInYear,
	|	RoomType.* AS RoomType,
	|	Room.* AS Room,
	|	RoomTo.* AS RoomTo,
	|	AccommodationType.* AS AccommodationType,
	|	Customer.* AS Customer,
	|	RoomInventory.Recorder.CustomerType.* AS CustomerType,
	|	RoomInventory.Recorder.Contract.* AS Contract,
	|	RoomInventory.Recorder.ContactPerson AS ContactPerson,
	|	RoomInventory.Recorder.Agent.* AS Agent,
	|	GuestGroup.* AS GuestGroup,
	|	RoomInventory.Recorder.HotelProduct.* AS HotelProduct,
	|	AccommodationStatus.* AS AccommodationStatus,
	|	RoomInventory.Recorder.RoomQuota.* AS RoomQuota,
	|	RoomInventory.Recorder.ClientType.* AS ClientType,
	|	RoomInventory.Recorder.MarketingCode.* AS MarketingCode,
	|	RoomInventory.Recorder.TripPurpose.* AS TripPurpose,
	|	RoomInventory.Recorder.SourceOfBusiness.* AS SourceOfBusiness,
	|	RoomInventory.Recorder.RoomRateType.* AS RoomRateType,
	|	RoomInventory.Recorder.AccommodationTemplate.* AS AccommodationTemplate,
	|	RoomRate.* AS RoomRate,
	|	PricePresentation AS PricePresentation,
	|	RoomInventory.Recorder.DiscountCard.* AS DiscountCard,
	|	RoomInventory.Recorder.DiscountType.* AS DiscountType,
	|	RoomInventory.Recorder.Author.* AS Author,
	|	RoomInventory.Recorder.* AS Recorder,
	|	RoomInventory.ForeignerRegistryRecord.* AS ForeignerRegistryRecord,
	|	RoomInventory.ClientDataScan.* AS ClientDataScan,
	|	RoomInventory.Recorder.PlannedPaymentMethod.* AS PlannedPaymentMethod,
	|	NumberOfCheckins}";
	#КонецВставки
	#Удаление
	QueryText = 
	"SELECT
	|	RoomInventory.Recorder.Hotel AS Hotel,
	|	RoomInventory.Room AS Room,
	|	RoomInventory.Recorder.Customer AS Customer,
	|	RoomInventory.Recorder.AccommodationStatus AS AccommodationStatus,
	|	RoomInventory.Recorder.Guest AS Guest,
	|	RoomInventory.CheckInDate AS CheckInDate,
	|	RoomInventory.Duration AS Duration,
	|	RoomInventory.CheckOutDate AS CheckOutDate,
	|	RoomInventory.RoomType AS RoomType,
	|	RoomInventory.AccommodationType AS AccommodationType,
	|	RoomInventory.Recorder.RoomRate AS RoomRate,
	|	RoomInventory.Recorder.Remarks AS Remarks,
	|	RoomInventory.Recorder.GuestGroup AS GuestGroup,
	|	CASE
	|		WHEN &qShowMainRoomGuestsOnly
	|			THEN ISNULL(RoomInventory.Recorder.NumberOfAdults, 0) + ISNULL(RoomInventory.Recorder.NumberOfTeenagers, 0) + ISNULL(RoomInventory.Recorder.NumberOfChildren, 0) + ISNULL(RoomInventory.Recorder.NumberOfInfants, 0)
	|		ELSE RoomInventory.InHouseGuests
	|	END AS InHouseGuests,
	|	ISNULL(RoomInventory.Recorder.NumberOfAdults, 0) AS NumberOfAdults,
	|	ISNULL(RoomInventory.Recorder.NumberOfTeenagers, 0) AS NumberOfTeenagers,
	|	ISNULL(RoomInventory.Recorder.NumberOfChildren, 0) AS NumberOfChildren,
	|	ISNULL(RoomInventory.Recorder.NumberOfInfants, 0) AS NumberOfInfants,
	|	RoomInventory.InHouseRooms AS InHouseRooms,
	|	RoomInventory.InHouseBeds AS InHouseBeds,
	|	RoomInventory.InHouseAdditionalBeds AS InHouseAdditionalBeds,
	|	RoomInventory.Recorder.HotelProduct.Sum AS HotelProductSum,
	|	RoomInventory.Recorder.PricePresentation AS PricePresentation,
	|	ExpectedRoomMoves.Room AS RoomTo,
	|	ISNULL(GuestPeriodSales.Sales, 0) AS Sales,
	|	ISNULL(GuestPeriodSales.RoomRevenue, 0) AS RoomRevenue,
	|	ISNULL(ClientBalances.ClientSumBalance, 0) AS ClientSumBalance,
	|	ISNULL(ClientTotals.NumberOfCheckins, 0) AS NumberOfCheckins
	|{SELECT
	|	Hotel.*,
	|	Room.*,
	|	RoomInventory.Recorder.CustomerType.* AS CustomerType,
	|	Customer.*,
	|	RoomInventory.Recorder.Contract.* AS Contract,
	|	RoomInventory.Recorder.ContactPerson AS ContactPerson,
	|	RoomInventory.Recorder.Agent.* AS Agent,
	|	RoomInventory.Recorder.ClientType.* AS ClientType,
	|	Guest.*,
	|	CheckInDate,
	|	Duration,
	|	CheckOutDate,
	|	RoomInventory.CheckInAccountingDate AS CheckInAccountingDate,
	|	RoomInventory.CheckOutAccountingDate AS CheckOutAccountingDate,
	|	(HOUR(RoomInventory.Recorder.CheckInDate)) AS CheckInHour,
	|	(DAY(RoomInventory.Recorder.CheckInDate)) AS CheckInDay,
	|	(WEEK(RoomInventory.Recorder.CheckInDate)) AS CheckInWeek,
	|	(MONTH(RoomInventory.Recorder.CheckInDate)) AS CheckInMonth,
	|	(QUARTER(RoomInventory.Recorder.CheckInDate)) AS CheckInQuarter,
	|	(YEAR(RoomInventory.Recorder.CheckInDate)) AS CheckInYear,
	|	RoomType.*,
	|	AccommodationType.*,
	|	RoomInventory.Recorder.RoomRateType.* AS RoomRateType,
	|	RoomInventory.Recorder.AccommodationTemplate.* AS AccommodationTemplate,
	|	RoomRate.*,
	|	PricePresentation,
	|	RoomInventory.Recorder.PlannedPaymentMethod.* AS PlannedPaymentMethod,
	|	InHouseGuests,
	|	NumberOfAdults,
	|	NumberOfTeenagers,
	|	NumberOfChildren,
	|	NumberOfInfants,
	|	InHouseRooms,
	|	InHouseBeds,
	|	InHouseAdditionalBeds,
	|	Remarks,
	|	RoomInventory.Recorder.Car AS Car,
	|	GuestGroup.*,
	|	AccommodationStatus.*,
	|	RoomInventory.Recorder.IsMaster AS IsMaster,
	|	RoomInventory.Recorder.HotelProduct.* AS HotelProduct,
	|	RoomInventory.Recorder.RoomQuota.* AS RoomQuota,
	|	RoomInventory.Recorder.MarketingCode.* AS MarketingCode,
	|	RoomInventory.Recorder.TripPurpose.* AS TripPurpose,
	|	RoomInventory.Recorder.SourceOfBusiness.* AS SourceOfBusiness,
	|	RoomInventory.Recorder.DiscountCard.* AS DiscountCard,
	|	RoomInventory.Recorder.DiscountType.* AS DiscountType,
	|	RoomInventory.Recorder.Discount AS Discount,
	|	RoomInventory.Recorder.AgentCommission AS AgentCommission,
	|	RoomInventory.Recorder.AgentCommissionType AS AgentCommissionType,
	|	RoomInventory.Recorder.RoomQuantity AS RoomQuantity,
	|	RoomInventory.Recorder.NumberOfBedsPerRoom AS NumberOfBedsPerRoom,
	|	RoomInventory.Recorder.NumberOfPersonsPerRoom AS NumberOfPersonsPerRoom,
	|	HotelProductSum,
	|	RoomInventory.Recorder.HotelProduct.Currency.* AS HotelProductCurrency,
	|	RoomInventory.Recorder.ParentDoc.* AS ParentDoc,
	|	RoomInventory.Recorder.Author.* AS Author,
	|	RoomInventory.Recorder.* AS Recorder,
	|	RoomTo.*,
	|	RoomInventory.ForeignerRegistryRecord.* AS ForeignerRegistryRecord,
	|	RoomInventory.ClientDataScan.* AS ClientDataScan,
	|	(CASE
	|			WHEN RoomInventory.ForeignerRegistryRecord.MigrationCardDateTo <> &qEmptyDate
	|				THEN DATEDIFF(RoomInventory.ForeignerRegistryRecord.MigrationCardDateTo, RoomInventory.Recorder.CheckOutDate, DAY)
	|			ELSE 0
	|		END) AS MigrationCardDateToDeviance,
	|	(CASE
	|			WHEN RoomInventory.ForeignerRegistryRecord.VisaToDate <> &qEmptyDate
	|				THEN DATEDIFF(RoomInventory.ForeignerRegistryRecord.VisaToDate, RoomInventory.Recorder.CheckOutDate, DAY)
	|			ELSE 0
	|		END) AS VisaToDateDeviance,
	|	RoomInventory.Recorder.PointInTime AS PointInTime,
	|	Sales,
	|	RoomRevenue,
	|	ClientSumBalance,
	|	NumberOfCheckins,
	|	(NULL) AS EmptyColumn}
	|FROM
	|	(SELECT
	|		RoomInventoryPeriods.Recorder AS Recorder,
	|		RoomInventoryPeriods.Room AS Room,
	|		RoomInventoryPeriods.RoomType AS RoomType,
	|		RoomInventoryPeriods.AccommodationType AS AccommodationType,
	|		RoomInventoryPeriods.PeriodFrom AS CheckInDate,
	|		RoomInventoryPeriods.PeriodDuration AS Duration,
	|		RoomInventoryPeriods.PeriodTo AS CheckOutDate,
	|		RoomInventoryPeriods.CheckInAccountingDate AS CheckInAccountingDate,
	|		RoomInventoryPeriods.CheckOutAccountingDate AS CheckOutAccountingDate,
	|		CASE
	|			WHEN ForeignerRegistryRecords.ForeignerRegistryRecord IS NULL
	|				THEN &qEmptyForeignerRegistryRecord
	|			ELSE ForeignerRegistryRecords.ForeignerRegistryRecord
	|		END AS ForeignerRegistryRecord,
	|		CASE
	|			WHEN ClientDataScans.Ref IS NULL
	|				THEN &qEmptyClientDataScan
	|			ELSE ClientDataScans.Ref
	|		END AS ClientDataScan,
	|		MAX(RoomInventoryPeriods.InHouseGuests) AS InHouseGuests,
	|		MAX(RoomInventoryPeriods.InHouseRooms) AS InHouseRooms,
	|		MAX(RoomInventoryPeriods.InHouseBeds) AS InHouseBeds,
	|		MAX(RoomInventoryPeriods.InHouseAdditionalBeds) AS InHouseAdditionalBeds
	|	FROM
	|		AccumulationRegister.RoomInventory AS RoomInventoryPeriods
	|			LEFT JOIN InformationRegister.AccommodationForeignerRegistryRecords.SliceLast(&qEndOfTime, &qShowFRR) AS ForeignerRegistryRecords
	|			ON RoomInventoryPeriods.Recorder = ForeignerRegistryRecords.Accommodation
	|			LEFT JOIN Document.ClientDataScans AS ClientDataScans
	|			ON RoomInventoryPeriods.Recorder = ClientDataScans.ParentDoc
	|				AND (ClientDataScans.Posted)
	|				AND (&qShowCDS)
	|	WHERE
	|		RoomInventoryPeriods.RecordType = VALUE(AccumulationRecordType.Expense)
	|		AND RoomInventoryPeriods.IsAccommodation = TRUE
	|		AND RoomInventoryPeriods.Hotel IN HIERARCHY(&qHotel)
	|		AND RoomInventoryPeriods.Room IN HIERARCHY(&qRoom)
	|		AND RoomInventoryPeriods.RoomType IN HIERARCHY(&qRoomType)
	|		AND (&qCustomerIsEmpty
	|				OR RoomInventoryPeriods.Customer IN HIERARCHY (&qCustomer))
	|		AND (&qGuestIsEmpty
	|				OR RoomInventoryPeriods.Guest IN HIERARCHY (&qGuest))
	|		AND (ISNULL(RoomInventoryPeriods.AccommodationStatus.IsInHouse, FALSE)
	|				OR NOT &qShowInHouseOnly)
	|		AND (NOT ISNULL(RoomInventoryPeriods.AccommodationStatus.IsInHouse, FALSE)
	|				OR NOT &qShowNotInHouseOnly)
	|		AND (RoomInventoryPeriods.PeriodFrom < &qPeriodTo
	|					AND RoomInventoryPeriods.PeriodTo > &qPeriodFrom
	|					AND &qPeriodCheckType = &qAccommodation
	|				OR RoomInventoryPeriods.PeriodFrom >= &qPeriodFrom
	|					AND RoomInventoryPeriods.PeriodFrom < &qPeriodTo
	|					AND RoomInventoryPeriods.PeriodFrom = RoomInventoryPeriods.CheckInDate
	|					AND (&qPeriodCheckType = &qCheckIn
	|						OR &qPeriodCheckType = &qCheckInOrCheckOut)
	|				OR RoomInventoryPeriods.PeriodTo > &qPeriodFrom
	|					AND RoomInventoryPeriods.PeriodTo <= &qPeriodTo
	|					AND RoomInventoryPeriods.PeriodTo = RoomInventoryPeriods.CheckOutDate
	|					AND (&qPeriodCheckType = &qCheckOut
	|						OR &qPeriodCheckType = &qCheckInOrCheckOut)
	|				OR RoomInventoryPeriods.Recorder.Date >= &qPeriodFrom
	|					AND RoomInventoryPeriods.Recorder.Date < &qPeriodTo
	|					AND &qPeriodCheckType = &qDocDateInPeriod)
	|	
	|	GROUP BY
	|		RoomInventoryPeriods.Recorder,
	|		RoomInventoryPeriods.Room,
	|		RoomInventoryPeriods.RoomType,
	|		RoomInventoryPeriods.AccommodationType,
	|		RoomInventoryPeriods.PeriodFrom,
	|		RoomInventoryPeriods.PeriodDuration,
	|		RoomInventoryPeriods.PeriodTo,
	|		RoomInventoryPeriods.CheckInAccountingDate,
	|		RoomInventoryPeriods.CheckOutAccountingDate,
	|		CASE
	|			WHEN ForeignerRegistryRecords.ForeignerRegistryRecord IS NULL
	|				THEN &qEmptyForeignerRegistryRecord
	|			ELSE ForeignerRegistryRecords.ForeignerRegistryRecord
	|		END,
	|		CASE
	|			WHEN ClientDataScans.Ref IS NULL
	|				THEN &qEmptyClientDataScan
	|			ELSE ClientDataScans.Ref
	|		END) AS RoomInventory
	|		LEFT JOIN (SELECT
	|			GuestSales.ParentDoc AS ParentDoc,
	|			GuestSales.SalesTurnover AS Sales,
	|			GuestSales.RoomRevenueTurnover AS RoomRevenue
	|		FROM
	|			AccumulationRegister.Sales.Turnovers(
	|					&qBegOfPeriodFrom,
	|					&qEndOfPeriodTo,
	|					,
	|					&qShowSales
	|						AND NOT IsCorrection) AS GuestSales) AS GuestPeriodSales
	|		ON RoomInventory.Recorder = GuestPeriodSales.ParentDoc
	|			AND (&qShowSales)
	|		LEFT JOIN (SELECT
	|			AccountsBalance.Folio.ParentDoc AS FolioParentDoc,
	|			SUM(AccountsBalance.SumBalance) AS ClientSumBalance
	|		FROM
	|			AccumulationRegister.Accounts.Balance(
	|					&qEndOfPeriodTo,
	|					&qShowBalances
	|						AND (Folio.Customer = &qEmptyCustomer
	|							OR Folio.Customer <> &qEmptyCustomer
	|								AND Folio.Customer.IsIndividual)) AS AccountsBalance
	|		
	|		GROUP BY
	|			AccountsBalance.Folio.ParentDoc) AS ClientBalances
	|		ON RoomInventory.Recorder = ClientBalances.FolioParentDoc
	|			AND (&qShowBalances)
	|		LEFT JOIN (SELECT
	|			ClientTurnovers.Client AS Client,
	|			ClientTurnovers.GuestsCheckedInTurnover AS NumberOfCheckins
	|		FROM
	|			AccumulationRegister.Sales.Turnovers(
	|					,
	|					&qBegOfPeriodFrom,
	|					PERIOD,
	|					&qNumberOfVisitsIsUsed
	|						AND NOT IsCorrection
	|						AND (&qHotelIsEmpty
	|							OR Hotel IN HIERARCHY (&qHotel))) AS ClientTurnovers) AS ClientTotals
	|		ON RoomInventory.Recorder.Guest = ClientTotals.Client
	|		LEFT JOIN Document.Accommodation.RoomRates AS ExpectedRoomMoves
	|		ON RoomInventory.Recorder = ExpectedRoomMoves.Ref
	|			AND RoomInventory.Recorder.Room <> ExpectedRoomMoves.Room
	|			AND (BEGINOFPERIOD(ExpectedRoomMoves.AccountingDate, DAY) = &qBegOfPeriodFrom)
	|WHERE
	|	(NOT &qShowMainRoomGuestsOnly
	|			OR &qShowMainRoomGuestsOnly
	|				AND RoomInventory.Recorder.AccommodationTemplate <> &qEmptyTemplate)
	|	AND (NOT &qShowRoomMovesOnly
	|			OR &qShowRoomMovesOnly
	|				AND NOT ExpectedRoomMoves.Room IS NULL)
	|{WHERE
	|	RoomInventory.Recorder.* AS Recorder,
	|	RoomInventory.ForeignerRegistryRecord.* AS ForeignerRegistryRecord,
	|	RoomInventory.ClientDataScan.* AS ClientDataScan,
	|	RoomInventory.Recorder.Hotel.* AS Hotel,
	|	RoomInventory.RoomType.* AS RoomType,
	|	RoomInventory.Room.* AS Room,
	|	RoomInventory.AccommodationType.* AS AccommodationType,
	|	RoomInventory.Recorder.Customer.* AS Customer,
	|	RoomInventory.Recorder.CustomerType AS CustomerType,
	|	RoomInventory.Recorder.Contract.* AS Contract,
	|	RoomInventory.Recorder.ContactPerson AS ContactPerson,
	|	RoomInventory.Recorder.Agent.* AS Agent,
	|	RoomInventory.Recorder.GuestGroup.* AS GuestGroup,
	|	RoomInventory.Recorder.ParentDoc.* AS ParentDoc,
	|	RoomInventory.Recorder.HotelProduct.* AS HotelProduct,
	|	RoomInventory.Recorder.AccommodationStatus.* AS AccommodationStatus,
	|	RoomInventory.CheckInDate AS CheckInDate,
	|	RoomInventory.Duration AS Duration,
	|	RoomInventory.CheckOutDate AS CheckOutDate,
	|	RoomInventory.CheckInAccountingDate AS CheckInAccountingDate,
	|	RoomInventory.CheckOutAccountingDate AS CheckOutAccountingDate,
	|	(CASE
	|			WHEN &qShowMainRoomGuestsOnly
	|				THEN ISNULL(RoomInventory.Recorder.NumberOfAdults, 0) + ISNULL(RoomInventory.Recorder.NumberOfTeenagers, 0) + ISNULL(RoomInventory.Recorder.NumberOfChildren, 0) + ISNULL(RoomInventory.Recorder.NumberOfInfants, 0)
	|			ELSE RoomInventory.InHouseGuests
	|		END) AS InHouseGuests,
	|	(ISNULL(RoomInventory.Recorder.NumberOfAdults, 0)) AS NumberOfAdults,
	|	(ISNULL(RoomInventory.Recorder.NumberOfTeenagers, 0)) AS NumberOfTeenagers,
	|	(ISNULL(RoomInventory.Recorder.NumberOfChildren, 0)) AS NumberOfChildren,
	|	(ISNULL(RoomInventory.Recorder.NumberOfInfants, 0)) AS NumberOfInfants,
	|	RoomInventory.InHouseRooms AS InHouseRooms,
	|	RoomInventory.InHouseBeds AS InHouseBeds,
	|	RoomInventory.InHouseAdditionalBeds AS InHouseAdditionalBeds,
	|	(ISNULL(GuestPeriodSales.Sales, 0)) AS Sales,
	|	(ISNULL(GuestPeriodSales.RoomRevenue, 0)) AS RoomRevenue,
	|	(ISNULL(ClientBalances.ClientSumBalance, 0)) AS ClientSumBalance,
	|	RoomInventory.Recorder.RoomQuota.* AS RoomQuota,
	|	RoomInventory.Recorder.RoomQuantity AS RoomQuantity,
	|	RoomInventory.Recorder.ClientType.* AS ClientType,
	|	RoomInventory.Recorder.Guest.* AS Guest,
	|	RoomInventory.Recorder.MarketingCode.* AS MarketingCode,
	|	RoomInventory.Recorder.TripPurpose.* AS TripPurpose,
	|	RoomInventory.Recorder.SourceOfBusiness.* AS SourceOfBusiness,
	|	RoomInventory.Recorder.RoomRateType.* AS RoomRateType,
	|	RoomInventory.Recorder.RoomRate.* AS RoomRate,
	|	RoomInventory.Recorder.PricePresentation AS PricePresentation,
	|	RoomInventory.Recorder.DiscountCard.* AS DiscountCard,
	|	RoomInventory.Recorder.DiscountType.* AS DiscountType,
	|	RoomInventory.Recorder.Discount AS Discount,
	|	RoomInventory.Recorder.PlannedPaymentMethod.* AS PlannedPaymentMethod,
	|	RoomInventory.Recorder.Car AS Car,
	|	RoomInventory.Recorder.Remarks AS Remarks,
	|	RoomInventory.Recorder.Author.* AS Author,
	|	RoomInventory.Recorder.AgentCommission AS AgentCommission,
	|	RoomInventory.Recorder.AgentCommissionType.* AS AgentCommissionType,
	|	RoomInventory.Recorder.AccommodationTemplate.* AS AccommodationTemplate,
	|	RoomInventory.Recorder.IsMaster AS IsMaster,
	|	ExpectedRoomMoves.Room.* AS RoomTo,
	|	(CASE
	|			WHEN RoomInventory.ForeignerRegistryRecord.MigrationCardDateTo <> &qEmptyDate
	|				THEN DATEDIFF(RoomInventory.ForeignerRegistryRecord.MigrationCardDateTo, RoomInventory.Recorder.CheckOutDate, DAY)
	|			ELSE 0
	|		END) AS MigrationCardDateToDeviance,
	|	(CASE
	|			WHEN RoomInventory.ForeignerRegistryRecord.VisaToDate <> &qEmptyDate
	|				THEN DATEDIFF(RoomInventory.ForeignerRegistryRecord.VisaToDate, RoomInventory.Recorder.CheckOutDate, DAY)
	|			ELSE 0
	|		END) AS VisaToDateDeviance,
	|	(ISNULL(ClientTotals.NumberOfCheckins, 0)) AS NumberOfCheckins,
	|	RoomInventory.Recorder.AccommodationStatus.IsCheckIn AS IsCheckIn,
	|	RoomInventory.Recorder.AccommodationStatus.IsCheckOut AS IsCheckOut,
	|	RoomInventory.Recorder.AccommodationStatus.IsRoomChange AS IsRoomChange,
	|	RoomInventory.Recorder.AccommodationStatus.IsInHouse AS IsInHouse}
	|
	|ORDER BY
	|	Hotel,
	|	Room,
	|	CheckInDate,
	|	Guest
	|{ORDER BY
	|	RoomInventory.Recorder.* AS Recorder,
	|	RoomInventory.ForeignerRegistryRecord.* AS ForeignerRegistryRecord,
	|	RoomInventory.ClientDataScan.* AS ClientDataScan,
	|	Customer.* AS Customer,
	|	RoomInventory.Recorder.CustomerType.* AS CustomerType,
	|	RoomInventory.Recorder.Contract.* AS Contract,
	|	RoomInventory.Recorder.Agent.* AS Agent,
	|	GuestGroup.* AS GuestGroup,
	|	Guest.* AS Guest,
	|	RoomInventory.Recorder.MarketingCode.* AS MarketingCode,
	|	RoomInventory.Recorder.TripPurpose.* AS TripPurpose,
	|	RoomInventory.Recorder.SourceOfBusiness.* AS SourceOfBusiness,
	|	RoomRate.* AS RoomRate,
	|	RoomInventory.Recorder.RoomRateType.* AS RoomRateType,
	|	RoomInventory.Recorder.DiscountCard.* AS DiscountCard,
	|	RoomInventory.Recorder.DiscountType.* AS DiscountType,
	|	RoomInventory.Recorder.PlannedPaymentMethod.* AS PlannedPaymentMethod,
	|	Room.* AS Room,
	|	RoomType.* AS RoomType,
	|	AccommodationType.* AS AccommodationType,
	|	RoomTo.* AS RoomTo,
	|	Hotel.* AS Hotel,
	|	RoomInventory.Recorder.PointInTime AS PointInTime,
	|	CheckInDate AS CheckInDate,
	|	Duration AS Duration,
	|	CheckOutDate AS CheckOutDate,
	|	RoomInventory.Recorder.RoomRateType.* AS RoomRateType,
	|	RoomInventory.Recorder.AccommodationTemplate.* AS AccommodationTemplate,
	|	RoomRate.* AS RoomRate,
	|	PricePresentation AS PricePresentation,
	|	RoomInventory.Recorder.Author.* AS Author,
	|	InHouseGuests AS InHouseGuests,
	|	NumberOfAdults,
	|	NumberOfTeenagers,
	|	NumberOfChildren,
	|	NumberOfInfants,
	|	InHouseRooms AS InHouseRooms,
	|	InHouseBeds AS InHouseBeds,
	|	InHouseAdditionalBeds AS InHouseAdditionalBeds,
	|	RoomInventory.CheckInAccountingDate AS CheckInAccountingDate,
	|	RoomInventory.CheckOutAccountingDate AS CheckOutAccountingDate,
	|	(HOUR(RoomInventory.Recorder.CheckInDate)) AS CheckInHour,
	|	(DAY(RoomInventory.Recorder.CheckInDate)) AS CheckInDay,
	|	(WEEK(RoomInventory.Recorder.CheckInDate)) AS CheckInWeek,
	|	(MONTH(RoomInventory.Recorder.CheckInDate)) AS CheckInMonth,
	|	(QUARTER(RoomInventory.Recorder.CheckInDate)) AS CheckInQuarter,
	|	(YEAR(RoomInventory.Recorder.CheckInDate)) AS CheckInYear,
	|	Sales,
	|	RoomRevenue,
	|	ClientSumBalance,
	|	NumberOfCheckins,
	|	RoomInventory.Recorder.RoomQuota.* AS RoomQuota}
	|TOTALS
	|	SUM(InHouseGuests),
	|	SUM(NumberOfAdults),
	|	SUM(NumberOfTeenagers),
	|	SUM(NumberOfChildren),
	|	SUM(NumberOfInfants),
	|	SUM(InHouseRooms),
	|	SUM(InHouseBeds),
	|	SUM(InHouseAdditionalBeds),
	|	SUM(HotelProductSum),
	|	SUM(Sales),
	|	SUM(RoomRevenue),
	|	SUM(ClientSumBalance)
	|BY
	|	OVERALL,
	|	Hotel,
	|	Room
	|{TOTALS BY
	|	Hotel.* AS Hotel,
	|	RoomInventory.CheckInAccountingDate AS CheckInAccountingDate,
	|	RoomInventory.CheckOutAccountingDate AS CheckOutAccountingDate,
	|	(HOUR(RoomInventory.Recorder.CheckInDate)) AS CheckInHour,
	|	(DAY(RoomInventory.Recorder.CheckInDate)) AS CheckInDay,
	|	(WEEK(RoomInventory.Recorder.CheckInDate)) AS CheckInWeek,
	|	(MONTH(RoomInventory.Recorder.CheckInDate)) AS CheckInMonth,
	|	(QUARTER(RoomInventory.Recorder.CheckInDate)) AS CheckInQuarter,
	|	(YEAR(RoomInventory.Recorder.CheckInDate)) AS CheckInYear,
	|	RoomType.* AS RoomType,
	|	Room.* AS Room,
	|	RoomTo.* AS RoomTo,
	|	AccommodationType.* AS AccommodationType,
	|	Customer.* AS Customer,
	|	RoomInventory.Recorder.CustomerType.* AS CustomerType,
	|	RoomInventory.Recorder.Contract.* AS Contract,
	|	RoomInventory.Recorder.ContactPerson AS ContactPerson,
	|	RoomInventory.Recorder.Agent.* AS Agent,
	|	GuestGroup.* AS GuestGroup,
	|	RoomInventory.Recorder.HotelProduct.* AS HotelProduct,
	|	AccommodationStatus.* AS AccommodationStatus,
	|	RoomInventory.Recorder.RoomQuota.* AS RoomQuota,
	|	RoomInventory.Recorder.ClientType.* AS ClientType,
	|	RoomInventory.Recorder.MarketingCode.* AS MarketingCode,
	|	RoomInventory.Recorder.TripPurpose.* AS TripPurpose,
	|	RoomInventory.Recorder.SourceOfBusiness.* AS SourceOfBusiness,
	|	RoomInventory.Recorder.RoomRateType.* AS RoomRateType,
	|	RoomInventory.Recorder.AccommodationTemplate.* AS AccommodationTemplate,
	|	RoomRate.* AS RoomRate,
	|	PricePresentation AS PricePresentation,
	|	RoomInventory.Recorder.DiscountCard.* AS DiscountCard,
	|	RoomInventory.Recorder.DiscountType.* AS DiscountType,
	|	RoomInventory.Recorder.Author.* AS Author,
	|	RoomInventory.Recorder.* AS Recorder,
	|	RoomInventory.ForeignerRegistryRecord.* AS ForeignerRegistryRecord,
	|	RoomInventory.ClientDataScan.* AS ClientDataScan,
	|	RoomInventory.Recorder.PlannedPaymentMethod.* AS PlannedPaymentMethod,
	|	NumberOfCheckins}";
	#КонецУдаления
	ReportBuilder.Text = QueryText;
	ReportBuilder.FillSettings();

	// Initialize report builder with default query
	vRB = New ReportBuilder(QueryText);
	vRBSettings = vRB.GetSettings(True, True, True, True, True);
	ReportBuilder.SetSettings(vRBSettings, True, True, True, True, True);

	// Set default report builder header text
	ReportBuilder.HeaderText = NStr("en='Room occupation history';de='Zimmerbesatzungsgeschichte';ru='История заселения номеров'");

	// Fill report builder fields presentations from the report template
	cmFillReportAttributesPresentations(ThisObject);

	// Reset report builder template
	ReportBuilder.Template = Undefined;EndProcedure
